#====================================================
# Author: Валерій Мануйлик
#====================================================
# Виходи для VPC, підмереж і групи безпеки
# Це дозволяє використовувати ці значення в інших модулях або в ресурсах
# GitHub: https://github.com/BlessedXd
#====================================================

# Вихідний параметр для ID VPC.
# Може бути використаний в інших модулях для посилання на цей VPC.
output "vpc_id" {
    value = aws_vpc.main.id  # ID створеного VPC.
}

# Вихідний параметр для CIDR блоку VPC.
# Це дозволяє отримати CIDR блок VPC для використання в інших ресурсах або модулях.
output "vpc_cidr" {
    value = aws_vpc.main.cidr_block  # CIDR блок створеного VPC.
}

# Вихідний параметр для ID публічних підмереж.
# Це дозволяє отримати список ID публічних підмереж для використання в інших модулях.
output "public_subnet_ids" {
    value = aws_subnet.public_subnets[*].id  # Список ID публічних підмереж.
}

# Вихідний параметр для ID приватних підмереж.
# Це дозволяє отримати список ID приватних підмереж для використання в інших модулях.
output "private_subnet_ids" {
    value = aws_subnet.private_subnets[*].id  # Список ID приватних підмереж.
}

# Вихідний параметр для ID групи безпеки.
# Може бути використаний в інших модулях або ресурсах для посилання на цю групу безпеки.
output "security_group_id" {
    value = aws_security_group.dev_sg.id  # ID створеної групи безпеки.
}

output "dev_sg" {
  value = aws_security_group.dev_sg
}